base/Catalogs/бит_СтатусыОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_СтатусыОбъектов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Comment>Порядок следования статусов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оформление</Name>
					<Comment>Оформление</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретИзмененияВложений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСтатуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипыСтатусовОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/Enums/бит_ВидыОбъектовСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыОбъектовСистемы</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Справочник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Документ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланСчетов</Name>
					<Comment>План счетов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланВидовХарактеристик</Name>
					<Comment>План видов характеристик</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрСведений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрНакопления</Name>
					<Comment>Регистр накопления</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрБухгалтерии</Name>
					<Comment>Регистр бухгалтерии</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Задача</Name>
					<Comment>Задача</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БизнесПроцесс</Name>
					<Comment>Бизнес процесс</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Catalogs/бит_СтатусыОбъектов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьКэшЗначений();
	
	// Восстановим настройки оформления из хранилища.
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		СпрОб = Параметры.ЗначениеКопирования.ПолучитьОбъект();
	Иначе	
		СпрОб = РеквизитФормыВЗначение("Объект");
	КонецЕсли; 
	
	НастройкаОформления = СпрОб.ПолучитьОформление();
	Если ТипЗнч(НастройкаОформления) = Тип("Структура") Тогда
		
		бит_ОбщегоНазначения.УстановитьСвойствоИзСтруктуры(ЭтотОбъект, НастройкаОформления, "Шрифт"     , "фШрифт");
		бит_ОбщегоНазначения.УстановитьСвойствоИзСтруктуры(ЭтотОбъект, НастройкаОформления, "ШрифтАвто" , "фШрифтАвто");
		бит_ОбщегоНазначения.УстановитьСвойствоИзСтруктуры(ЭтотОбъект, НастройкаОформления, "ЦветФона"  , "фЦветФона");
		бит_ОбщегоНазначения.УстановитьСвойствоИзСтруктуры(ЭтотОбъект, НастройкаОформления, "ЦветТекста", "фЦветТекста");
		
	Иначе
		
		фЦветФона  = ЦветаСтиля.бит_ЦветФонаРМКИнформация;
		фШрифтАвто = Истина;
		фШрифт 	   = фКэшЗначений.ШрифтАвто;
		
	КонецЕсли; 	
		
КонецПроцедуры 

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Запишем установленное оформление.
	СтруктураОформление = Новый Структура;
	СтруктураОформление.Вставить("Шрифт" 	 , фШрифт);
	СтруктураОформление.Вставить("ШрифтАвто" , фШрифтАвто);
	СтруктураОформление.Вставить("ЦветФона"	 , фЦветФона);
	СтруктураОформление.Вставить("ЦветТекста", фЦветТекста);   	
	
	ТекущийОбъект.СохранитьОформление(СтруктураОформление);  	
	
КонецПроцедуры // ПередЗаписьюНаСервере()

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОбъектНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидыОбъектов"           , фКэшЗначений.ДоступныеВидыОбъектов);
	ПараметрыФормы.Вставить("ТекущийОбъектСистемы"   , Объект.Объект);
	ПараметрыФормы.Вставить("ДоступныеОбъектыСистемы", фКэшЗначений.ДоступныеОбъектыСистемы);
	
	ОткрытьФорму("ОбщаяФорма.бит_ФормаВыбораОбъектовСистемы", ПараметрыФормы, Элемент);
	   	
КонецПроцедуры // ОбъектНачалоВыбора()

&НаКлиенте
Процедура фШрифтПриИзменении(Элемент)
	
	фШрифтАвто = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура фШрифтАвтоПриИзменении(Элемент)
	
	Если фШрифтАвто Тогда
	 	фШрифт = Новый Шрифт;
	Иначе
		фШрифт = фКэшЗначений.ШрифтПоУмолчанию;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура заполняет кэш значений доступных на сервере и на клиенте.
// 
&НаСервере
Процедура ЗаполнитьКэшЗначений()

	фКэшЗначений = Новый Структура;	
 
	ДоступныеВидыОбъектов = Новый СписокЗначений;
	ДоступныеВидыОбъектов.Добавить(Перечисления.бит_ВидыОбъектовСистемы.Документ);
	Если бит_ОбщегоНазначения.ЭтоСемействоERP() Тогда
		ДоступныеВидыОбъектов.Добавить(Перечисления.бит_ВидыОбъектовСистемы.Справочник);
	КонецЕсли;
	ДоступныеВидыОбъектов.Добавить(Перечисления.бит_ВидыОбъектовСистемы.Задача);
	ДоступныеВидыОбъектов.Добавить(Перечисления.бит_ВидыОбъектовСистемы.БизнесПроцесс);

	фКэшЗначений.Вставить("ДоступныеВидыОбъектов", ДоступныеВидыОбъектов); 

	ДоступныеОбъектыСистемы = бит_ВизированиеСервер.ВизируемыеОбъектыСистемы();
	ТекОб = Справочники.бит_ОбъектыСистемы.ОбъектСистемыПоПолномуИмени("Задача.бит_Задача"); 
	Если ЗначениеЗаполнено(ТекОб) Тогда 	 
		ДоступныеОбъектыСистемы.Добавить(ТекОб);	 
	КонецЕсли;

	ТекОб = Справочники.бит_ОбъектыСистемы.ОбъектСистемыПоПолномуИмени("БизнесПроцесс.бит_Процесс"); 
	Если ЗначениеЗаполнено(ТекОб) Тогда 	 
		ДоступныеОбъектыСистемы.Добавить(ТекОб);  	 
	КонецЕсли; 

	фКэшЗначений.Вставить("ДоступныеОбъектыСистемы", ДоступныеОбъектыСистемы);
	фКэшЗначений.Вставить("ШрифтПоУмолчанию"	   , ШрифтыСтиля.ОбычныйШрифтТекста);
	фКэшЗначений.Вставить("ШрифтАвто"	   		   , Новый Шрифт);
	
КонецПроцедуры // ЗаполнитьКэшЗначений()

#КонецОбласти
